; domain
(define (domain blocks)
  (:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions :typing)

  (:types
    robot block - object
  )

  (:predicates 
    (on ?block1 - block ?block2 - block)
    (ontable ?block - block)
    (clear ?block - block)
    (KBquery_fullHands ?robot - robot)
    (holding ?robot - robot ?block - block)
  )

  (:action pick-up
    :parameters (?robot - robot ?block - block)
    :precondition (and 
      (clear ?block) 
      (ontable ?block) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (not (ontable ?block))
        (not (clear ?block))
        (holding ?robot ?block)
      )
  )

  (:action put-down
    :parameters (?robot - robot ?block - block)
    :precondition (holding ?robot ?block)
    :effect
      (and 
        (not (holding ?robot ?block))
        (clear ?block)
        (ontable ?block)
      )
  )

  (:action stack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (holding ?robot ?block1) 
      (clear ?block2)
      )
    :effect
      (and 
        (not (holding ?robot ?block1))
        (not (clear ?block2))
        (clear ?block1)
        (on ?block1 ?block2)
      )
  )

  (:action unstack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (on ?block1 ?block2) 
      (clear ?block1) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (holding ?robot ?block1)
        (clear ?block2)
        (not (clear ?block1))
        (not (on ?block2 ?block1))
      )
  )
)

; problem
(define (problem BLOCKS-4-0)
(:domain BLOCKS)
(:objects B D A C - block pr2 - robot)
(:INIT (CLEAR C) (CLEAR A) (CLEAR B) (CLEAR D) (ONTABLE C) (ONTABLE A)
 (ONTABLE B) (ONTABLE D))
(:goal (AND (ON D C) (ON C B) (ON B A)))
)

; plan
1. (pick-up pr2 d)
   deleted: (ontable d) (clear d)
   added: (holding pr2 d)
   goals met: 0 of 3
2. (pick-up pr2 b)
   deleted: (ontable b) (clear b)
   added: (holding pr2 b)
   goals met: 0 of 3
3. (stack pr2 b a)
   deleted: (holding pr2 b) (clear a)
   added: (clear b) (on b a)
   goals met: 1 of 3
4. (pick-up pr2 c)
   deleted: (ontable c) (clear c)
   added: (holding pr2 c)
   goals met: 1 of 3
5. (stack pr2 c b)
   deleted: (holding pr2 c) (clear b)
   added: (clear c) (on c b)
   goals met: 2 of 3
6. (stack pr2 d c)
   deleted: (holding pr2 d) (clear c)
   added: (clear d) (on d c)
   goals met: 3 of 3
